DataProcessors/MRS_АРМ_Закрытия_смены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>MRS_АРМ_Закрытия_смены</Name>
			<Comment>Швецов. 17.02.2026. АРМ Закрытия смены</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетСверка</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФронтСистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыКасс</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КассаККМ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФронтСистема</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТочкиПродаж</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеТочкиПродаж</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/MRS_АРМ_Закрытия_смены/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗагрузитьПараметрыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФронтСистемаПриИзменении(Элемент)
	
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеОтклоненияПриИзменении(Элемент)
	
	ОбновитьФлажки("ВсеОтклонения");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтклоненияПоСуммеПриИзменении(Элемент)
	
	ОбновитьФлажки("ОтклоненияПоСумме");
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекНеНайденПриИзменении(Элемент)
	
	ОбновитьФлажки("ЧекНеНайден");
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекиАлкогольПриИзменении(Элемент)
	
	ОбновитьФлажки("ЧекиАлкоголь");
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНеЗаполненаПриИзменении(Элемент)
	
	ОбновитьФлажки("НоменклатураНеЗаполнена");
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалОтбораДатаПриИзменении(Элемент)
	
	MRS_ИнтервалОтбора.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	НачалоПериода = MRS_ИнтервалОтбора.ДатаНачала;
	КонецПериода   = MRS_ИнтервалОтбора.КонецПериода;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сверить(Команда)
	
	СверитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	ЗагрузитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДаты(Команда)
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ИнтервалОтбораПриИзмененииЗавершение", ЭтотОбъект);
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = MRS_ИнтервалОтбора;
	Диалог.Показать(ОбработчикОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Объект.ПараметрыКасс Цикл
		СтрокаТаблицы.Использовать = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Объект.ПараметрыКасс Цикл
		СтрокаТаблицы.Использовать = Истина;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СверитьНаСервере()
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ВсеОтклонения",           ВсеОтклонения);
	СтруктураОтбора.Вставить("ЧекНеНайден",             ЧекНеНайден);
	СтруктураОтбора.Вставить("ЧекиАлкоголь",            ЧекиАлкоголь);
	СтруктураОтбора.Вставить("ОтклоненияПоСумме",       ОтклоненияПоСумме);
	СтруктураОтбора.Вставить("НоменклатураНеЗаполнена", НоменклатураНеЗаполнена);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПолучитьОтчетСверки(СтруктураОтбора);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПараметрыФормы()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьПараметрыФормы();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ВыполнитьЗагрузкуДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалОтбораПриИзмененииЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	MRS_ИнтервалОтбора = Период;
	Объект.НачалоПериода = MRS_ИнтервалОтбора.ДатаНачала;
	Объект.КонецПериода  = MRS_ИнтервалОтбора.ДатаОкончания;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФорму()
	
	ЗагрузитьПараметрыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФлажки(ИмяТекущегоФлажка)
	
	Если ЭтотОбъект[ИмяТекущегоФлажка] Тогда
		
		// Список всех флажков
		МассивФлажков = Новый Массив;
		МассивФлажков.Добавить("ОтклоненияПоСумме");
		МассивФлажков.Добавить("ЧекНеНайден");
		МассивФлажков.Добавить("ЧекиАлкоголь");
		МассивФлажков.Добавить("НоменклатураНеЗаполнена");
		
		Если ИмяТекущегоФлажка = "ВсеОтклонения" Тогда
			
			Для Каждого ИмяФлажка Из МассивФлажков Цикл
				ЭтотОбъект[ИмяФлажка] = Ложь;
			КонецЦикла;
			
		Иначе
			
			ЭтотОбъект.ВсеОтклонения = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
